# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K – положительное число.
# Input: [1, 2, 3, 4, 5] k = 2
# Output: [4, 5, 1, 2, 3]

# a = [1, 2, 3, 4, 5]
# b = a.copy()
# k = 2
# for i in range(len(a)):
#     if i + k < len(a):
#         a[i] = b[i-k]
#     else:
#         a[i] = b[i-k - len(a)]    
#     i += 1
# print(a)

# a = [1, 2, 3, 4, 5]
# k = 2
# p1 = a[:-k]
# p2 = a[-k:]
# print(p2+p1)

# a = [1, 2, 3, 4, 5]
# k = 2
# for i in range(k):
#     a.insert(0, a.pop())
# print(a)